In [15]:
# librerias a importar

import pandas as pd
pd.set_option('display.max_columns', None)
#pd.set_option('display.max_rows', None)

import numpy as np

import warnings
warnings.filterwarnings('ignore')

import pylab as plt 
import seaborn as sns
import matplotlib.pyplot as plt

In [16]:
inventory_ori = pd.read_csv('../data/inventory.csv', encoding='latin1')

inventory =  inventory_ori.copy()

inventory.head(10)

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17
5             6        1         2  2006-02-15 05:09:17
6             7        1         2  2006-02-15 05:09:17
7             8        1         2  2006-02-15 05:09:17
8             9        2         2  2006-02-15 05:09:17
9            10        2         2  2006-02-15 05:09:17

In [17]:
inventory.shape

(1000, 4)

In [18]:
inventory.duplicated().any() #no hay duplicados

False

In [19]:
inventory.duplicated(subset=['inventory_id', 'film_id', 'store_id']).any() #hay duplicados pero con dif id??

False

In [20]:
inventory.info(memory_usage='deep') #ac√° ya vemos que no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 97.8 KB

In [21]:
inventory.drop(columns=["last_update"], inplace=True) #chau last update

In [22]:
inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

In [23]:
inventory.shape #dimension actual

(1000, 3)

In [24]:
inventory.to_csv('inventory_limpio.csv', index=False)

In [25]:
inventory.describe()

       inventory_id      film_id     store_id
count   1000.000000  1000.000000  1000.000000
mean     500.500000   109.866000     1.497000
std      288.819436    63.862042     0.500241
min        1.000000     1.000000     1.000000
25%      250.750000    56.000000     1.000000
50%      500.500000   111.500000     1.000000
75%      750.250000   164.000000     2.000000
max     1000.000000   223.000000     2.000000

In [26]:
from sqlalchemy import create_engine

In [27]:
str_conn = f'mysql+pymysql://root:Joaquin01@localhost:3306/proyecto_sql'
cursor = create_engine(str_conn)

In [28]:
inventory.to_sql(name='limpieza_inventory',       # nombre de la tabla
            con=cursor,           # conexion al servidor
            if_exists='replace',  # replace sobreescribe la tabla
            index=True)

1000